InformationRegisters/РСК_АналогиИЗамены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_АналогиИЗамены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриемникНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемникХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемникСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникСерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвязи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_АналогиИЗаменыВидыСвязи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПревышаетОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Излишек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПотребностьПоКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗаписиРаспределенияЗапасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РСК_АналогиИЗаменыВидыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_АналогиИЗаменыВидыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аналог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РаспределениеЗапасовСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасовСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемоеПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаетсяПоНеподтвержденномуЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбеспеченКДате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбеспеченНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеНеПодтвержденное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбеспечениеВДокументахСервер/Ext/Module.bsl
//++ РС Консалт: Тарасов Михаил 22.02.2023 Задача 23959
//e1cib/data/Документ.Задание?ref=b9f22338004dbaef43605cf6e10c83d6

&После("ДоступныеОстаткиПерезаполнить")
Процедура РСК_ДоступныеОстаткиПерезаполнить(Форма, ПараметрыЗаполнения)
	
	Попытка
		А = Форма.Объект.Товары[0].РСК_ДоступноАналогов;
	Исключение 
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.Склад КАК Склад
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РСК_АналогиИЗамены.ПриемникНоменклатура КАК Номенклатура,
		|	РСК_АналогиИЗамены.ПриемникХарактеристика КАК Характеристика,
		|	РСК_АналогиИЗамены.ИсточникНоменклатура КАК АналогНоменклатура,
		|	РСК_АналогиИЗамены.ИсточникХарактеристика КАК АналогХарактеристика
		|ПОМЕСТИТЬ АналогиДоРазличных
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|ГДЕ
		|	РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|	И (РСК_АналогиИЗамены.ПриемникНоменклатура, РСК_АналогиИЗамены.ПриемникХарактеристика) В
		|			(ВЫБРАТЬ
		|				ТЧ.Номенклатура,
		|				ТЧ.Характеристика
		|			ИЗ
		|				ТЧ КАК ТЧ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РСК_АналогиИЗамены.ИсточникНоменклатура,
		|	РСК_АналогиИЗамены.ИсточникХарактеристика,
		|	РСК_АналогиИЗамены.ПриемникНоменклатура,
		|	РСК_АналогиИЗамены.ПриемникХарактеристика
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|ГДЕ
		|	РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|	И (РСК_АналогиИЗамены.ИсточникНоменклатура, РСК_АналогиИЗамены.ИсточникХарактеристика) В
		|			(ВЫБРАТЬ
		|				ТЧ.Номенклатура,
		|				ТЧ.Характеристика
		|			ИЗ
		|				ТЧ КАК ТЧ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РСК_АналогиИЗамены.ИсточникНоменклатура,
		|	РСК_АналогиИЗамены.ИсточникХарактеристика,
		|	РСК_АналогиИЗамены1.ИсточникНоменклатура,
		|	РСК_АналогиИЗамены1.ИсточникХарактеристика
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены1
		|		ПО РСК_АналогиИЗамены.ПриемникНоменклатура = РСК_АналогиИЗамены1.ПриемникНоменклатура
		|			И РСК_АналогиИЗамены.ПриемникХарактеристика = РСК_АналогиИЗамены1.ПриемникХарактеристика
		|			И РСК_АналогиИЗамены.ПриемникСерия = РСК_АналогиИЗамены1.ПриемникСерия
		|			И РСК_АналогиИЗамены.ВидСвязи = РСК_АналогиИЗамены1.ВидСвязи
		|ГДЕ
		|	РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|	И (РСК_АналогиИЗамены.ИсточникНоменклатура, РСК_АналогиИЗамены.ИсточникХарактеристика) В
		|			(ВЫБРАТЬ
		|				ТЧ.Номенклатура,
		|				ТЧ.Характеристика
		|			ИЗ
		|				ТЧ КАК ТЧ)
		|	И НЕ (РСК_АналогиИЗамены1.ИсточникНоменклатура, РСК_АналогиИЗамены1.ИсточникХарактеристика) В
		|				(ВЫБРАТЬ
		|					ТЧ.Номенклатура,
		|					ТЧ.Характеристика
		|				ИЗ
		|					ТЧ КАК ТЧ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	АналогиДоРазличных.Номенклатура КАК Номенклатура,
		|	АналогиДоРазличных.Характеристика КАК Характеристика,
		|	АналогиДоРазличных.АналогНоменклатура КАК АналогНоменклатура,
		|	АналогиДоРазличных.АналогХарактеристика КАК АналогХарактеристика
		|ПОМЕСТИТЬ Аналоги
		|ИЗ
		|	АналогиДоРазличных КАК АналогиДоРазличных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Характеристика КАК Характеристика,
		|	ТЧ.Склад КАК Склад,
		|	Аналоги.АналогНоменклатура КАК АналогНоменклатура,
		|	Аналоги.АналогХарактеристика КАК АналогХарактеристика
		|ПОМЕСТИТЬ АналогиТЧ
		|ИЗ
		|	ТЧ КАК ТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Аналоги КАК Аналоги
		|		ПО ТЧ.Номенклатура = Аналоги.Номенклатура
		|			И ТЧ.Характеристика = Аналоги.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АналогиТЧ.Номенклатура КАК Номенклатура,
		|	АналогиТЧ.Характеристика КАК Характеристика,
		|	АналогиТЧ.Склад КАК Склад,
		|	СУММА(РаспределениеЗапасов.Свободно) КАК РСК_ДоступноАналогов
		|ИЗ
		|	АналогиТЧ КАК АналогиТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
		|		ПО (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
		|			И (РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
		|			И (РаспределениеЗапасов.Склад = АналогиТЧ.Склад)
		|			И (РаспределениеЗапасов.Номенклатура = АналогиТЧ.АналогНоменклатура)
		|			И (РаспределениеЗапасов.Характеристика = АналогиТЧ.АналогХарактеристика)
		|
		|СГРУППИРОВАТЬ ПО
		|	АналогиТЧ.Номенклатура,
		|	АналогиТЧ.Характеристика,
		|	АналогиТЧ.Склад"; 
	Запрос.УстановитьПараметр("ТЧ", Форма.Объект.Товары.Выгрузить(, "Номенклатура, Характеристика, Склад"));
	
	ВДЗ = Запрос.Выполнить().Выбрать();
	СтруктураПоиска = Новый Структура;
	
	Для Каждого Строка ИЗ Форма.Объект.Товары Цикл       
		
		ВДЗ.Сбросить();  
		
		СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
		СтруктураПоиска.Вставить("Склад", Строка.Склад);
		
		Строка.РСК_ДоступноАналогов = ?(ВДЗ.НайтиСледующий(СтруктураПоиска), ВДЗ.РСК_ДоступноАналогов, 0);
		
	КонецЦикла;
			
КонецПроцедуры     

//-- КонецЗадачи 23959
